Что такое декораторы в python? Как их создавать? Как создавать декораторы с параметрами? Приведите пример декоратора.
1. Декоратор в Python - это функция, которая меняет или расширяет поведение другой функции/метода/класса, при этом не изменяя их исходный код.
С помощью декораторов можно добавлять дополнительную функциональность к существующим функциям (логирование, проверку прав доступа, кэширование)
Декораторы используют принцип "обертки" - они принимают функцию в качестве аргумента, выполняют некоторые дополнительные действия и возвращают новую функцию.
2. Чтобы создать декоратор в Python, нужно определить функцию, которая принимает другую функцию в качестве аргумента и возвращает новую функцию с добавленным функционалом.
Внутри декоратора часто используется вложенная функция, которая и будет оборачивать изначальную.
3. Если нужно передавать параметры в декоратор, создается дополнительный уровень вложенности.
Декоратор, принимающий параметры, должен вернуть сам декоратор.
4. Пример использования декоратора дял логирования, я привёл в файле example.py

log(func) — это сам декоратор

def wrapper(*args, **kwargs): — внутри декоратора создается функция wrapper, которая заменяет исходную функцию

*args — это список аргументов, которые могут быть переданы в исходную функцию

**kwargs — это словарь, содержащий аргументы с именем

print(f"Вызов функции {func.__name__} с аргументами {args} и {kwargs}") — перед тем, как выполнить функцию, вводится информацию о том, что вызываем функцию, какие у нее аргументы, и что вообще это за функция

start_time = time.time() — здесь сохраняется текущее время перед выполнением функции

result = func(*args, **kwargs) — это вызов самой функции

end_time = time.time() — после выполнения функции записывается время, когда выполнение завершилось

print(f"Функция {func.__name__} выполнена за {end_time - start_time} секунд") — выводится информация о том, сколько времени заняло выполнение функции

return result — возвращается результат работы функции, чтобы декоратор не изменил его

return wrapper — декоратор log возвращает функцию wrapper, которая теперь заменяет исходную функцию
